let numbers=[2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
let i = 0

while (i< numbers.length){
    const num = numbers[i]
    console.log(num)
    i++;



}




//     2. перебрати його циклом for
for (const number of numbers) {
    console.log(number)

}
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
let i = 0;
while (i){



  i++;
}


// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)